<html>

  <head>
    <script type="text/javascript" src="../language.js"></script>

    <meta http-equiv="Content-Type"
     content="text/html; charset=ISO-8859-1"><link type="text/css" rel="stylesheet"
     href="../estilo.css"><title>Vin&iacute;cius Gusm&atilde;o Pereira de S&aacute;</title>

  </head> 
 
  <body onload="autoLanguage()">    

    <h2>Matem&aacute;tica Combinat&oacute;ria&nbsp;  &#8212;  &nbsp;2013/2</h2>
    
    <p><a href="..">P&aacute;gina principal</a><br>
                  
<!--    <p>&nbsp;</p>  -->

    <div><h3>Informa&ccedil;&otilde;es</h3></div>
    
        <div>Local: Sala <del>F2-021</del> F2-030 do CCMN.<br>
                        Hor&aacute;rio: 3as e 5as, das 8h &agrave;s 10h.<br>
                        In&iacute;cio: 20 de agosto de 2013.<br>
                        
                        <br>
                        Reposit&oacute;rio do c&oacute;digo criado em sala de aula: <br><a target="_blank" href="https://github.com/vigusmao/MatComb_2013_2">https://github.com/vigusmao/MatComb_2013_2</a>
                       <br><br>
                       
                       Ementa muito resumida:<br>
                       - &nbsp; Técnicas de Contagem<br>
                       - &nbsp; Relações de Recorrência<br>
                       - &nbsp; Introdução à Teoria dos Grafos

                    <br><br>
                        
                        <font color="black">N&atilde;o haver&aacute; aula nos dias:<br>
                            - &nbsp; 17/09 (SBPO 2013)<br>
                            - &nbsp; 19/09 (SBPO 2013)<br>
                            - &nbsp; 01/10 (Jornada de Iniciação Científica)<br>
                            - &nbsp; 03/10 (Jornada de Iniciação Científica)
                        <br><br>
                        
                        <font color="black">Aulas extras (d&uacute;vidas):<br>
                            - &nbsp; 11/10, &agrave;s 13h, na sala F2-030<br>
                            - &nbsp; 27/11, &agrave;s 12h, na sala F2-030<br>
                            - &nbsp; 10/12, &agrave;s 8h, na sala F2-030
                            
                        <br><br>
                        
                                                
                        <font color="black">Provas:<br>
                            - &nbsp; P1: <del>10/10</del> 15/10<br>
                            - &nbsp; P2: <del>21/11</del> <del>26/11</del> 28/11<br>
                            - &nbsp; PF: <del>28/11</del> <del>05/12</del> 12/12<br>
                            - &nbsp; 2Ch: 17/12 (segunda chamada apenas para quem perdeu alguma prova), &agrave;s 8h na sala do DCC
                        <br><br>
                        
                        M = (P1 + P2) / 2 &ge; 6.0 --> aprova&ccedil;&atilde;o direta; <br>
                        do contr&aacute;rio, MF = (M + PF) / 2 &ge; 5.0 --> aprova&ccedil;&atilde;o; <br>
                        MF < 5.0 --> reprova&ccedil;&atilde;o.
                        <br>
                       
                        <br>
                        Primeira Lista de Exerc&iacute;cios <a target="_blank" href="/../listas/MATCOMB_2013_2_Lista_1.pdf">aqui</a>.
                        <br>
                        Segunda Lista de Exerc&iacute;cios <a target="_blank" href="/../listas/MATCOMB_2013_2_Lista_2.pdf">aqui</a>.
                        <br><br> 
                        
                        <b>As notas já se encontram digitadas no SIGA.</b>
                        
                                               
                    
                        
                
                        
<br>

    <div><h3>Bibliografia sugerida</h3></div>
    
    <table>  
     
        <tr>
            <td><a target="_blank" href="http://issuu.com/livrariavestseller/docs/0064">An&aacute;lise Combinat&oacute;ria e Probabilidade</a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td><a target="_blank" href="http://www.lcm.com.br/site/#/livros/detalhesLivro/curso-de-analise-combinatoria-e-probabilidade---aprendendo-com-a-resolucao-de-problemas.html">Curso de An&aacute;lise Combinat&oacute;ria e Probabilidade</a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td><a target="_blank" href="http://books.google.com.br/books/about/Applied_combinatorics.html?id=FdMZAQAAIAAJ&redir_esc=y">Applied Combinatorics</a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
        </tr> 
        <tr> 
            <td>(Morgado, Pitombeira, Carvalho e Fernandes)</td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td>(J. R. Julianeli, B. A. Dassie, M. L. Alves de Lima e I. Pereira de S&aacute;)</td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td>(Alan Tucker)</td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
        </tr>
        <tr>
            <td><a target="_blank" href="http://issuu.com/livrariavestseller/docs/0064"><img style="height: 180px" src="../images/books/morgado.jpg"/></a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td><a target="_blank" href="http://www.lcm.com.br/site/#/livros/detalhesLivro/curso-de-analise-combinatoria-e-probabilidade---aprendendo-com-a-resolucao-de-problemas.html"><img style="height: 180px" src="../images/books/combinatoria_ilydio.jpg"/></a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td><a target="_blank" href="http://books.google.com.br/books/about/Applied_combinatorics.html?id=FdMZAQAAIAAJ&redir_esc=y"/><img style="height: 180px" src="../images/books/tucker.jpg"/></a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
        </tr>
    </table>
    
<br><br>

<div><h3>Conteúdo das aulas</h3></div>
		

<h4><font color="blue">20/08</font></h4>
<br>
Introdu&ccedil;&atilde;o &agrave; Combinat&oacute;ria. Princ&iacute;pio aditivo. Princ&iacute;pio multiplicativo (Princ&iacute;pio Fundamental da Contagem). 
Decis&otilde;es sequenciadas no tempo. Permuta&ccedil;&otilde;es simples. Elementos contados repetidas vezes (dividir no final pelo n&uacute;mero de repeti&ccedil;&otilde;es de cada elemento).
T&eacute;cnica da parti&ccedil;&atilde;o (resolvendo as situa&ccedil;&otilde;es do tipo &quot;depende!&quot;).
<br><br>
Problema 1: Quantos casais distintos (um homem, uma mulher) poderiam ser formados em uma turma de 40 alunos e 10 alunas?
<br>
Problema 2: Quantas bandeiras distintas de três listras poderiam ser coloridas com 3 cores distintas escolhidas de um conjunto de 10 cores?
<br>
Problema 3: Quantas novas cores podem ser produzidas da mistura uniforme de 3 tintas de cores distintas escolhidas de um total de 4 cores distintas de tintas?
<br>
Problema 4: De quantas maneiras podem se sentar ao redor de uma mesa redonda 5 pessoas (A, B, C, D e E) de forma que duas delas (A e B) não fiquem lado-a-lado?
<br>
Problema 5: De quantas maneiras podem se posicionar em linha 7 pessoas (A, B, C, D, E, F e G) de forma que duas delas (A e B) não fiquem lado-a-lado?


	&nbsp;<br>
	&nbsp;<br>


<h4><font color="blue">22/08</font></h4>
<br>
Recomenda&ccedil;&atilde;o geral: come&ccedil;ar pelas restri&ccedil;&otilde;es. Nunca deixar de verificar se cada elemento do conjunto-alvo est&aacute; sendo contado exatamente uma vez (n&atilde;o mais de uma vez; n&atilde;o zero vezes). 
T&eacute;cnica da complementa&ccedil;&atilde;o 
(relaxamento de restri&ccedil&otilde;es seguido da subtra&ccedil;&atilde;o da quantidade de elementos indesejados). Tamanho do intervalo fechado de inteiros [<em>a</em>,<em>b</em>] igual a <em>b</em>-<em>a</em>+1.
<br><br>
Problema 6: Quantos gabaritos poss&iacute;veis admite uma prova de 10 quest&otilde;es em m&uacute;ltipla escolha, onde cada quest&atilde;o possui 4 op&ccedil;&otilde;es de resposta?
<br>
Problema 7: Quantos cart&otilde;es de resposta poss&iacute;veis existem para a prova do problema anterior contendo no m&aacute;ximo 1 quest&atilde;o deixada em branco?
<br>
Problema 8: Quantos s&atilde;o os n&uacute;meros pares de 4 algarismos (na base 10) com todos os algarismos distintos?
<br>
Problema 9: Quantos s&atilde;o os n&uacute;meros de 4 algarismos (na base 10) contendo pelo menos 2 algarismos repetidos? [<em>Obs.: Usar complementa&ccedil;&atilde;o aqui &eacute; uma boa; quebrar em casos fica muito mais custoso.</em>]

	&nbsp;<br>
	&nbsp;<br>
	

	
	
<h4><font color="blue">27/08</font></h4>
<br>
Combina&ccedil;&otilde;es simples. Somat&oacute;rio (para <em>p</em>=0,...,<em>n</em>) das combina&ccedil;&otilde;es de <em>n</em>, <em>p</em> a <em>p</em> = 2^<em>n</em>. 
Prova por argumento combinat&oacute;rio.
<br><br>
Problema 10: De quantas maneiras uma sala com 10 portas pode estar aberta?
<br>
Problema 11: De quantas maneiras pode-se compor uma comiss&atilde;o com 4 alunos de uma turma de 50 alunos?
<br>
Problema 12: Quantos s&atilde;o os subconjuntos de um conjunto de <em>n</em> elementos? [<em>Solu&ccedil;&atilde;o 1: por particionamento em tamanhos exatos, cobrindo subconjuntos de tamanhos de 0 a <em>n</em>.
Solu&ccedil;&atilde;o 2: atrav&eacute;s da decis&atilde;o, um elemento por vez, quanto a lev&aacute;-lo ou n&atilde;o para o subconjunto que se est&aacute; construindo.</em>]
<br>
Problema 13: De quantas maneiras podemos dividir 12 atletas em 2 equipes de v&ocirc;lei, cada uma com 6 atletas?
<br>
Problema 14: E se as equipes tivessem caracter&iacute;sticas que as tornassem distintas, como por exemplo uma equipe principal e uma equipe reserva?
<br>
Problema 15: E se quis&eacute;ssemos dividir aqueles 12 atletas em 3 equipes de 4 atletas cada?

	&nbsp;<br>
	&nbsp;<br>	
	
	
	

<h4><font color="blue">29/08</font></h4>
<br>
Permuta&ccedil;&otilde;es com elementos nem todos distintos. Anagramas. 
<br><br>
Problema 16: De quantas maneiras pode-se compor uma comiss&atilde;o com 3 alunos e 2 alunas de uma turma de 40 alunos e 10 alunas?
<br>
Problema 17: Supondo que José e Maria sejam alunos daquela turma e n&atilde;o possam ser ambos simultaneamente membros da comiss&atilde;o desejada,
de quantas maneiras poderemos comp&ocirc;-la?
<br>
Problema 18: Quantos s&atilde;o os anagramas da palavra CADERNO? E de CALOTA? E de ARARA?
<br>
Problema 19: Quantas s&atilde;o as poss&iacute;veis sequ&ecirc;ncias de resultados obtidos em 10 lan&ccedil;amentos de um dado nas quais o &quot;1&quot; aparece exatamente 2 vezes, 
o &quot;6&quot; aparece exatamente 3 vezes, e os demais resultados s&atilde;o todos distintos?
<br>
Problema 20: Refa&ccedil;a a quest&atilde;o anterior para 9 lan&ccedil;amentos. [<em>Muda completamente.</em>]
<br>
Problema 21: Refa&ccedil;a novamente a quest&atilde;o 19, agora para 8 lan&ccedil;amentos do dado [<em>Muda tudo completamente, mais uma vez.</em>]
<br>
Problema 22: Refa&ccedil;a a quest&atilde;o 21, mas considerando que os 3 lan&ccedil;amentos que n&atilde;o s&atilde;o &quot;1&quot; ou &quot;6&quot; n&atilde;o precisam ser distintos.
	
	&nbsp;<br>
	&nbsp;<br>	
	
	
<h4><font color="blue">03/09</font></h4>
<br>
Programa em Python para gera&ccedil;&atilde;o e contagem de objetos combinat&oacute;rios. C&oacute;digo no <a target="_blank" href="https://github.com/vigusmao/MatComb_2013_2/blob/master/DecidaGenerico.py">github</a>.
<br><br>
Problema 23: Quantas s&atilde;o as palavras de 5 letras (de um alfabeto de 26 letras) que possuem a letra A?
<br>
Problema 24: Idem, por&eacute;m a letra A n&atilde;o pode ser a primeira letra da palavra.
<br>
Problema 25: Quantas s&atilde;o as palavras de 5 letras que n&atilde;o possuem as letras &quot;CH&quot; aparecendo juntas, nessa ordem?

	&nbsp;<br>
	&nbsp;<br>	
	
<h4><font color="blue">05/09</font></h4>
<br>
Simetrias. Permuta&ccedil;&otilde;es circulares. N&uacute;mero de solu&ccedil;&otilde;es para a equa&ccedil;&atilde;o diofantina
<em>x</em><sub>1</sub> + <em>x</em><sub>2</sub> + ... + <em>x</em><sub><em>n</em></sub> = p.<br><br>
Problema 26: Quantas rodas de ciranda podemos formar com 4 crian&ccedil;as?
<br>
Problema 27: Quantos bambol&ecirc;s distintos podem ser obtidos pela interconex&atilde;o de 6 arcos pl&aacute;sticos de cores distintas?
<br>
Problema 28: De quantas maneiras podemos pintar as faces (inclusive a face de baixo) de uma imensa escultura na forma de um cubo que est&aacute; instalada sobre o gramado de um parque, utilizando para isso uma paleta de 6 cores, e sem repetir cor?
<br>
Problema 29: E quantos s&atilde;o os cubos distintos que podemos obter pela aplica&ccedil;&atilde;o das mesmas 6 cores do problema anterior, na situa&ccedil;&atilde;o em que o cubo se encontra &quot;solto no espa&ccedil;o&quot;?
<br>
Problema 30: [Revis&atilde;o] Dado um baralho de 52 cartas (3 de cada naipe), quantas s&atilde;o as extra&ccedil;&otilde;es de 3 cartas onde a primeira &eacute; de copas, a segunda &eacute; um rei, e a terceira n&atilde;o &eacute; uma dama?
	&nbsp;<br>
	&nbsp;<br>	
	
	
	
	
	
	
	
<h4><font color="blue">10/09</font></h4>
<br>
Combina&ccedil;&otilde;es completas. Arranjos.<br><br>
Problema 31: De quantas maneiras podemos compor uma bolsa com 3 frutas selecionadas de uma fruteira contendo 6 frutas (uma banana, uma laranja, uma ma&ccedil;&atilde;, uma goiaba, uma manga e uma tangerina)?
<br>
Problema 32: Quantas s&atilde;o as possibilidades de se comprar 3 potes de sorvete de 1 litro cada (um sabor por pote) em uma sorveteria que os vende em 6 sabores diferentes?
<br>
Problema 33: Quantos n&uacute;meros existem entre 0 e 1000 tais que seus algarismos (na base 10) constituem uma sequ&ecirc;ncia mon&oacute;tona n&atilde;o-decrescente?
<br>
Problema 34: Quantas palavras de 8 letras (de um alfabeto de 26 letras) existem contendo 3 consoantes distintas e 5 vogais n&atilde;o necessariamente distintas, mas ocorrendo da esquerda para a direita em conformidade com a ordem total A < E < I < O < U?

	&nbsp;<br>
	&nbsp;<br>
	
	

	
<h4><font color="blue">12/09</font></h4>
<br>
Os Lemas de Kaplansky.<br><br>

Problema 35: De quantas formas podem sentar-se 5 pessoas em um teatro que disp&otilde;e de 12 cadeiras alinhadas, sem que haja duas pessoas quaisquer sentadas lado-a-lado?
<br>
Problema 36: Qual seria a resposta para o problema anterior se as cadeiras estivessem organizadas circularmente ao redor do palco?
<br>
Problema 37: De quantas maneiras pode uma pessoa organizar seus treinos de nata&ccedil;&atilde;o ao longo dos dias da semana, dado que ela pretende nadar 3 dias por semana (durante todo o ano, e sempre nos mesmos dias), de forma que ela jamais nade em dois dias consecutivos?

	&nbsp;<br>
	&nbsp;<br>	
		
		

	
<h4><font color="blue">24/09</font></h4>
<br>
Generaliza&ccedil;&atilde;o do Primeiro Lema de Kaplansky para espa&ccedil;amento m&iacute;nimo <em>r</em> entre elementos selecionados. O Princ&iacute;pio da Inclus&atilde;o/Exclus&atilde;o.
<br><br>

Problema 38: De quantas formas podem sentar-se <em>p</em> pessoas em um teatro que disp&otilde;e de <em>n</em> cadeiras alinhadas, de forma que haja pelo menos <em>r</em> cadeiras livres entre uma pessoa e a pr&oacute;xima?
<br>
Problema 39 (para casa): Generalizar o Segundo Lema de Kaplansky.
<br>
Problema 40: Quantos n&uacute;meros inteiros de 1 a 100 s&atilde;o m&uacute;ltipos de 3 ou de 5?
<br>
Problema 41: Quantos s&atilde;o os anagramas da palavra PINDAMONHANGABA que come&ccedil;am pela letra A ou terminam com a letra G ou tem como segunda letra a letra I?
<br>
Problema 42 (revis&atilde;o): Dados dois conjuntos, D e C, de cardinalidades respectivamente <em>n</em> e <em>m</em>, quantas s&atilde;o as fun&ccedil;&otilde;s distintas de D em C?
</br>
Problema 43 (revis&atilde;o): Quantas dessas fun&ccedil;&otilde;s s&atilde;o injetoras?
<br>
Problema 44 (para casa): Quantas s&atilde;o as fun&ccedil;&otilde;s sobrejetoras de D em C?


	&nbsp;<br>
	&nbsp;<br>	
	

	
<h4><font color="blue">26/09</font></h4>
<br>
Enunciados d&uacute;bios. Fundamental: saber exatamente que problema queremos resolver.
<br><br>
Problema 45: De quantas maneiras 6 an&eacute;is distintos podem ser colocados em 4 dedos? (Suponha que sabemos previamente quais s&atilde;o os 4 dedos, e que os an&eacute;is s&atilde;o perfeitamente sim&eacute;tricos.)
<br>
Problema 46: De quantas maneiras 6 an&eacute;is podem ser colocados em exatamente 4 dos 5 dedos de uma m&atilde;o? 
<br>
Problema 47: De quantas maneiras 6 an&eacute;is podem ser colocados em no m&aacute;ximo 4 (e em pelo menos 1) dos 5 dedos de uma m&atilde;o? 
<br>
<br>
Maneiras <em>erradas</em> de se tentar resolver o problema 44. Erros que devem ser evitados.


	&nbsp;<br>
	&nbsp;<br>		


<h4><font color="blue">08/10</font></h4>
<br>
Solu&ccedil;&atilde;o do problema 44 usando o Princ&iacute;pio da Inclus&atilde;o/Exclus&atilde;o. 
O paradigma das part&iacute;culas que v&atilde;o de um ponto a outro num reticulado movendo-se apenas para cima ou para a direita (ou, analogamente, num &acirc;ngulo de 45 graus 
direita/cima ou esquerda/baixo). O Princ&iacute;pio da Reflex&atilde;o.

<br><br>
Problema 48: De quantas maneiras pode-se ir do ponto (0,0) ao ponto (20, 4) de um reticulado, caminhando-se sempre uma unidade de comprimento para a direita 
ou uma unidade de comprimento para cima?
<br>
Problema 49: Quantas s&atilde;o as poss&iacute;veis sequ&ecirc;ncias de apura&ccedil;&atilde;o de votos em uma elei&ccedil;&atilde;o com 2 candidatos e 20 eleitores, 
onde n&atilde;o houve votos brancos ou nulos e o primeiro candidato venceu com uma margem de 2 votos?
<br>
Problema 50: Idem, por&eacute;m agora sabe-se que em nenhum momento durante a apuira&ccedil;&atilde;o dos votos o candidato perdedor esteve &agrave; frente no placar.


	&nbsp;<br>
	&nbsp;<br>		


<h4><font color="blue">10/10</font></h4>
<br>
O Princ&iacute;pio de Dirichlet: princ&iacute;pio das gavetas, da casa do pombo etc.

<br><br>
Problema 51: Quantas pessoas &eacute; preciso haver em um grupo para que se possa garantir que duas delas nasceram no mesmo dia do ano?
<br>
Problema 52: Quantos alunos precisam responder &agrave; pergunta &quot;Em que dia voc&ecirc; prefere fazer a prova de MatComb (com 7 op&ccedil;&otilde;es de dia para a prova)?&quot; 
de forma que se possa garantir que pelo menos 5 alunos dar&atilde;o a mesma resposta?
<br>
Problema 53: Prove que, se selecionarmos 5 pontos na regi&atilde;o fechada delimitada por um quadrado de lado unit&aacute;rio, ent&atilde;o sempre haver&aacute; dois pontos &agrave;
dist&acirc;ncia menor ou igual a sqrt(2)/2 um do outro.
<br>
Problema 54: Prove que, se selecionarmos <em>n</em>+1 elementos do conjunto dos inteiros de 1 a 2<em>n</em>, 
ent&atilde;o sempre teremos selecionado dois n&uacute;meros <em>x</em> e <em>y</em> tais que <em>x</em> divide <em>y</em> ou vice-versa.

	&nbsp;<br>
	&nbsp;<br>
	
<h4><font color="blue">11/10</font></h4>
<br>
Aula extra de exerc&iacute;cios.
	
	&nbsp;<br>
	&nbsp;<br>

<h4><font color="blue">15/10</font></h4>
<br>
Primeira prova.
	
	&nbsp;<br>
	&nbsp;<br>
    &nbsp;<br>

	
---- FIM DA PRIMEIRA PARTE DO CURSO ----
    
    &nbsp;<br>
	&nbsp;<br>
	&nbsp;<br>
	
<h4><font color="blue">24/10</font></h4>
<br>
Bin&ocirc;mio de Newton.<br>
(Aula ministrada pelo Prof. Jo&atilde;o Paix&atilde;o.)

	&nbsp;<br>
	&nbsp;<br>

<h4><font color="blue">29/10</font></h4>
<br>
Resolu&ccedil;&atilde;o das quest&otilde;es da P1.

	&nbsp;<br>
	&nbsp;<br>

<h4><font color="blue">31/10</font></h4>
<br>
Tri&acirc;ngulo de Pascal. 

	&nbsp;<br>
	&nbsp;<br>


<h4><font color="blue">05/11</font></h4>
<br>
Rela&ccedil;&otilde;es de recorr&ecirc;ncia.<br>
<br>
Problema 55: Encontre o n&uacute;mero de maneiras de se subir uma escada de <em>n</em> degraus,
subindo-se um ou dois degraus a cada passo.
<br>
Problema 56: Em quantas regi&otilde;es arco-conexas fica subdividido um plano que cont&eacute;m
<em>n</em> retas, duas a duas concorrentes, sabendo-se que nenhum ponto do plano pertence a mais de duas retas?
<br>
Problema 57: Quantas s&atilde;o as sequ&ecirc;ncias bin&aacute;rias de <em>n</em> bits que n&atilde;o cont&ecirc;m
tr&ecirc;s bits 1 seguidos?


	&nbsp;<br>
	&nbsp;<br>


<h4><font color="blue">07/11</font></h4>
<br>
Rela&ccedil;&otilde;es de recorr&ecirc;ncia: mais exemplos. Obtendo f&oacute;rmulas fechadas por substitui&ccedil;&atilde;o.<br>
<br>
Problema 58: Quantas s&atilde;o as sequ&ecirc;ncias bin&aacute;rias de <em>n</em> bits que possuem uma quantidade par de bits 1?
[<em>Solu&ccedil;&atilde;o 1: Pelo somat&oacute;rio das combina&ccedil;&otilde;es de n, k a k, para 0 &le; k &le; n/2. 
Solu&ccedil;&atilde;o 2: rela&ccedil;&atilde;o de recorr&ecirc;ncia obtida pela t&eacute;cnica de se isolar o primeiro passo.
Solu&ccedil;&atilde;o 3: por uma bije&ccedil;&atilde;o entre o conjunto desejado e o conjunto de todas as sequ&ecirc;ncias de n-1 bits.</em>]
<br>
Problema 59: Rela&ccedil;&atilde;o de recorr&ecirc;ncia para juros simples.
<br>
Problema 60: Rela&ccedil;&atilde;o de recorr&ecirc;ncia para juros compostos.
<br>
Problema 61: Rela&ccedil;&atilde;o de recorr&ecirc;ncia para juros compostos com aporte mensal.
<br>
[<em>Obs.: F&oacute;rmulas fechadas para todos os problemas acima.</em>]


	&nbsp;<br>
	&nbsp;<br>


<h4><font color="blue">12/11</font></h4>
<br>
Montando rela&ccedil;&otilde;es de recorr&ecirc;ncia.<br>
<br>
Problema 62: De quantos modos <em>n</em> domin&oacute;s 2x1 sim&eacute;tricos e id&ecirc;nticos podem cobrir um tabuleiro de damas 2x<em>n</em>?
<br>
Problema 63: E se os domin&oacute;s n&atilde;o fossem sim&eacute;tricos?
<br>
Problema 64: De quantos modos podem ser ocupadas todas as <em>n</em> vagas alinhadas de um estacionamento utilizando-se
carros de passeio brancos, carros de passeio prata, carros de passeio pretos e caminh&otilde;es, e sabendo-se que caminh&otilde;es ocupam duas vagas consecutivas?
<br>
Problema 65: Uma m&aacute;quina possue <em>n</em> chaves liga/desliga. Para mudar o estado da <em>j</em>-&eacute;sima chave, &eacute; preciso que a (<em>j</em>-1)-&eacute;sima
chave esteja ligada, e todas as chaves desde a (<em>j-2</em>)-&eacute;sima at&eacute; a primeira estejam desligadas. A primeira chave pode sempre ter seu estado alterado, sem restri&ccedil;&otilde;es.
Partindo de um estado inicial onde todas as chaves se encontram desligadas, qual o n&uacute;mero m&iacute;nimo de <em>flips</em> (mudan&ccedil;as de estado de chave)  
que &eacute; suficiente para se deixar a <em>n</em>-&eacute;sima chave ligada e todas as demais chaves desligadas?


	&nbsp;<br>
	&nbsp;<br>


<h4><font color="blue">14/11</font></h4>
<br>
Rela&ccedil;&otilde;es de recorr&ecirc;ncia do tipo &quot;dividir e conquistar&quot;.
Provando f&oacute;rmulas fechadas por indu&ccedil;&atilde;o. Obtendo f&oacute;rmulas fechadas para rela&ccedil;&otilde;es de recorr&ecirc;ncia homog&ecirc;neas.



	&nbsp;<br>
	&nbsp;<br>



<h4><font color="blue">19/11</font></h4>
<br>
Introdu&ccedil;&atilde;o &agrave; Teoria dos Grafos. V&eacute;rtice, aresta, digrafo, grau, caminhos e ciclos (hamiltonianos), trilhas e circuitos (eulerianos), 
teorema sobre a quantidade de v&eacute;rtices de grau &iacute;mpar, caracteriza&ccedil;&atilde;o de grafos com trilhas/circuitos eulerianos.


	&nbsp;<br>
	&nbsp;<br>




<h4><font color="blue">21/11</font></h4>
<br>
Grafos conexos/desconexos, c&iacute;clicos/ac&iacute;clicos, &aacute;rvores, fontes, sumidouros, digrafos ac&iacute;clicos. 
Grafos bipartidos, colora&ccedil;&atilde;o de v&eacute;rtices. Grafos completos, cliques.

	&nbsp;<br>
	&nbsp;<br>



<h4><font color="blue">26/11</font></h4>
<br>
Grafos planares (rela&ccedil;&atilde;o de Euler, K5, K3,3, Kuratowski), torneios (existência de um rei).

	&nbsp;<br>
	&nbsp;<br>

<h4><font color="blue">27/11</font></h4>
<br>
Aula extra de exerc&iacute;cios.
	
	&nbsp;<br>
	&nbsp;<br>

<h4><font color="blue">28/11</font></h4>
<br>
Segunda prova.
	
	&nbsp;<br>
	&nbsp;<br>

<h4><font color="blue">03/12</font></h4>
<br>
Resolu&ccedil;&atilde;o e entrega da P2.
	
	&nbsp;<br>
	&nbsp;<br>

<h4><font color="blue">10/12</font></h4>
<br>
Aula de exerc&iacute;cios.
	
	&nbsp;<br>
	&nbsp;<br>

<h4><font color="blue">12/12</font></h4>
<br>
Prova final.
	
	&nbsp;<br>
	&nbsp;<br>


    &nbsp;<br>


		<p>
        <a href=#><img title="Voltar ao topo" style="height: 35px" src="../seta_voltar.jpeg" alt="Voltar ao topo" ></a>
        </p>

		
  </body>

</html>
