<html>

  <head>
    <script type="text/javascript" src="../language.js"></script>

    <meta http-equiv="Content-Type"
     content="text/html; charset=ISO-8859-1"><link type="text/css" rel="stylesheet"
     href="../estilo.css"><title>Vin&iacute;cius Gusm&atilde;o Pereira de S&aacute;</title>

  </head> 
 
  <body onload="autoLanguage()">    

    <h2>Matem&aacute;tica Combinat&oacute;ria&nbsp;  &#8212;  &nbsp;2013/2</h2>
    
    <p><a href="..">P&aacute;gina principal</a><br>
                  
<!--    <p>&nbsp;</p>  -->

    <div><h3>Informa&ccedil;&otilde;es</h3></div>
    
        <div>Local: Sala <del>F2-022</del> F3-003 do CCMN.<br>
                        Hor&aacute;rio: 3as e 5as, das 8h &agrave;s 10h.<br>
                        In&iacute;cio: 5 de abril de 2016.<br>
                        
                        <br>
                        Reposit&oacute;rio do c&oacute;digo criado em sala de aula: <br><a target="_blank" href="https://github.com/vigusmao/MatComb_2016_1">https://github.com/vigusmao/MatComb_2016_1</a>
                       <br><br>
                       
                       Ementa muito resumida:<br>
                       - &nbsp; T&eacute;cnicas de Contagem<br>
                       - &nbsp; Bin&ocirc;mio de Newton, Tri&acirc;ngulo de Pascal<br>
                       - &nbsp; Rela&ccedil;&otilde;es de Recorr&ecirc;ncia<br>
                       - &nbsp; Introdução &agrave; Teoria dos Grafos

                    <br><br>
                        
<!--                        <font color="black">N&atilde;o haver&aacute; aula nos dias:<br>
                            - &nbsp; 17/09 (SBPO 2013)<br>
                            - &nbsp; 19/09 (SBPO 2013)<br>
                            - &nbsp; 01/10 (Jornada de Iniciação Científica)<br>
                            - &nbsp; 03/10 (Jornada de Iniciação Científica)
                        <br><br>
                        
                        <font color="black">Aulas extras (d&uacute;vidas):<br>
                            - &nbsp; 11/10, &agrave;s 13h, na sala F2-030<br>
                            - &nbsp; 27/11, &agrave;s 12h, na sala F2-030<br>
                            - &nbsp; 10/12, &agrave;s 8h, na sala F2-030
                            
                        <br><br>
                        
                                                
                        <font color="black">Provas:<br>
                            - &nbsp; P1: <del>10/10</del> 15/10<br>
                            - &nbsp; P2: <del>21/11</del> <del>26/11</del> 28/11<br>
                            - &nbsp; PF: <del>28/11</del> <del>05/12</del> 12/12<br>
                            - &nbsp; 2Ch: 17/12 (segunda chamada apenas para quem perdeu alguma prova), &agrave;s 8h na sala do DCC
                        <br><br>
                        
                        M = (P1 + P2) / 2 &ge; 6.0 -> aprova&ccedil;&atilde;o direta; <br>
                        do contr&aacute;rio, MF = (M + PF) / 2 &ge; 5.0 -> aprova&ccedil;&atilde;o; <br>
                        MF < 5.0 -> reprova&ccedil;&atilde;o.
                        <br>
                       
                        <br>
                        Primeira Lista de Exerc&iacute;cios <a target="_blank" href="/../listas/MATCOMB_2013_2_Lista_1.pdf">aqui</a>.
                        <br>
                        Segunda Lista de Exerc&iacute;cios <a target="_blank" href="/../listas/MATCOMB_2013_2_Lista_2.pdf">aqui</a>.
                        <br><br> 
                        
                        <b>As notas j&aacute; se encontram digitadas no SIGA.</b>
-->                        
                                               
                    
                        
                
                        
<br>

    <div><h3>Bibliografia sugerida</h3></div>
    
    <table>  
     
        <tr>
            <td><a target="_blank" href="http://issuu.com/livrariavestseller/docs/0064">An&aacute;lise Combinat&oacute;ria e Probabilidade</a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td><a target="_blank" href="http://www.lcm.com.br/site/#/livros/detalhesLivro/curso-de-analise-combinatoria-e-probabilidade---aprendendo-com-a-resolucao-de-problemas.html">Curso de An&aacute;lise Combinat&oacute;ria e Probabilidade</a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td><a target="_blank" href="http://books.google.com.br/books/about/Applied_combinatorics.html?id=FdMZAQAAIAAJ&redir_esc=y">Applied Combinatorics</a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
        </tr> 
        <tr> 
            <td>(Morgado, Pitombeira, Carvalho e Fernandes)</td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td>(J. R. Julianeli, B. A. Dassie, M. L. Alves de Lima e I. Pereira de S&aacute;)</td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td>(Alan Tucker)</td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
        </tr>
        <tr>
            <td><a target="_blank" href="http://issuu.com/livrariavestseller/docs/0064"><img style="height: 180px" src="../images/books/morgado.jpg"/></a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td><a target="_blank" href="http://www.lcm.com.br/site/#/livros/detalhesLivro/curso-de-analise-combinatoria-e-probabilidade---aprendendo-com-a-resolucao-de-problemas.html"><img style="height: 180px" src="../images/books/combinatoria_ilydio.jpg"/></a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
            <td><a target="_blank" href="http://books.google.com.br/books/about/Applied_combinatorics.html?id=FdMZAQAAIAAJ&redir_esc=y"/><img style="height: 180px" src="../images/books/tucker.jpg"/></a></td><td>&nbsp;&nbsp;&nbsp;&nbsp;</td>
        </tr>
    </table>
    
<br><br>

<div><h3>Conte&uacute;do das aulas</h3></div>
		

<h4><font color="blue">05/04</font></h4>
<br>
Introdu&ccedil;&atilde;o &agrave; Combinat&oacute;ria. Princ&iacute;pio multiplicativo (Princ&iacute;pio Fundamental da Contagem). 
Decis&otilde;es sequenciadas no tempo. Permuta&ccedil;&otilde;es simples. Recomenda&ccedil;&atilde;o geral: come&ccedil;ar pelas restri&ccedil;&otilde;es.
T&eacute;cnica da parti&ccedil;&atilde;o (resolvendo as situa&ccedil;&otilde;es do tipo &quot;depende!&quot;).
T&eacute;cnica da complementa&ccedil;&atilde;o 
(relaxamento de restri&ccedil&otilde;es seguido da subtra&ccedil;&atilde;o da quantidade de elementos indesejados).
<br><br>
Problema 1: Quantas ta&ccedil;as de sorvete (uma bola de sorvete, uma cobertura) distintas s&atilde;o oferecidas
em uma sorveteria que disp&otilde;e de 30 sabores de sorvete e de 4 tipos de cobertura?
<br><br>
Problema 2: De quantas maneiras distintas podemos estacionar 3 carros em 3 vagas de garagem (um carro por vaga)? 
<br><br>
Problema 3: De quantas maneiras podem se sentar ao redor de uma mesa redonda 5 pessoas (A, B, C, D e E) de forma que duas delas (A e B) n&atilde;o fiquem lado a lado?
<br><br>
Problema 4: De quantas maneiras podem se posicionar em linha 7 pessoas (A, B, C, D, E, F e G) de forma que duas delas (A e B) n&atilde;o fiquem lado a lado?
<br><br>
Problema 5: De quantas maneiras podem se posicionar em linha 7 pessoas de forma que duas delas (digamos, A e B) <em>fiquem</em> lado a lado?

	&nbsp;<br>
	&nbsp;<br>

<h4><font color="blue">07/04</font></h4>
<br>

Os dois testes b&aacute;sicos:<br><br>
1) Cada elemento do conjunto que me interessa pode ser obtido pela sequ&ecirc;ncia de decis&otilde;es que foi escolhida? 
(Resposta esperada: SIM!) <br>
2) &Eacute; poss&iacute;vel obter um mesmo elemento atrav&eacute;s de escolhas <em>diferentes</em> ao longo da sequ&ecirc;ncia escolhida?
(Resposta esperada: N&Atilde;O!)
Se um dos testes falhar, &eacute; preciso definir uma outra sequ&ecirc;ncia de decis&otilde;es, ou usar alguma t&eacute;cnica auxiliar.
<br><br>

Problema 6: Se dispomos de 5 tintas de cores distintas, de quantas maneiras podemos pintar uma bandeira que possui 3 faixas
verticais?
<br>
Problema 7: E se as faixas precisarem ser pintadas cada qual com um cor distinta das outras?
<br>
Problema 8: Novamente, se dispomos de 5 tintas diferentes (uma das quais &eacute; a cor verde) e uma bandeira de 3 faixas, 
de quantas maneiras podemos pintar a bandeira <b>com cores distintas</b>
garantindo que pelo menos uma das faixas receba a cor verde?
<br>
Problema 9: E como ficaria o problema anterior se <b>n&atilde;o</b> houvesse a exig&ecirc;ncia de que as cores das faixas fossem todas distintas?
<br><br>
Perceba que no Problema 9 a maneira mais intuitiva (para muitos) de raciocinar -- que seria aquela pela qual
come&ccedil;ar&iacute;amos escolhendo logo uma das faixas para pintarmos de verde, garantindo assim que a
exig&ecirc;ncia fosse de imediato atendida -- leva quase com certeza
a uma resposta errada. De fato, a sequ&ecirc;ncia de decis&otilde;es pela qual escolhemos uma faixa para pintar de verde,
depois escolhemos uma cor qualquer para a faixa mais &agrave; esquerda que ainda est&aacute; sem cor, 
e escolhemos finalmente uma cor qualquer para a &uacute;ltima faixa nos possibilita obter uma mesma atribui&ccedil;&atilde;o
de cores de diversas maneiras. Por exemplo, uma bandeira com as 3 faixas pintadas de verde pode ser obtida de 3 formas diferentes
(dependendo da faixa que escolhamos para ser pintada de verde na primeira decis&atilde;o). Duas boas maneiras de se resolver o problema 
aqui s&atilde;o: (i) quebrar em casos, de acordo com o n&uacute;mero de faixas (1, 2 ou 3) que receber&atilde;o a cor verde
(T&eacute;cnica da parti&ccedil;&atilde;o); ou (ii)
contar quantas s&atilde;o todas as maneiras poss&iacute;veis de se pintar a bandeira e subtrair o n&uacute;mero de maneiras
em que <b>nenhuma</b> faixa recebe a cor verde (T&eacute;cnica da complementa&ccedil;&atilde;o). 

	&nbsp;<br>
	&nbsp;<br>

<h4><font color="blue">19/04</font></h4>
<br>

Problema 10: Quantas novas cores podem ser produzidas da mistura uniforme de 3 tintas de cores distintas escolhidas de um total de 4 cores distintas de tintas?
<br><br>

Nos casos em que elementos s&atilde;o contados repetidas vezes de maneira uniforme, isto &eacute;, <em>cada elemento</em>
&eacute; contado exatamente o mesmo n&uacute;mero de vezes, podemos ignorar inicialmente essa redund&acirc;ncia e 
dividir no final pelo n&uacute;mero de vezes em que cada elemento &eacute; contado, isto &eacute;, pela quantidade de caminhos
na &aacute;rvore de decis&otilde;es que levam a um &uacute;nico dos elementos em que estamos interessados.

<br><br>

Combina&ccedil;&atilde;o de <em>n</em> elementos, <em>p</em> a <em>p</em>.
F&oacute;rmula deduzida. Combina&ccedil;&otilde;es complementares.

<br><br>

Problema 11: Quantas comiss&otilde;es distintas de 6 alunos poder&iacute;amos formar em uma turma de 30 alunos?
<br>
Problema 12: Quantas comiss&otilde;es distintas de 3 alunos e 3 alunas poder&iacute;amos formar em uma turma de 20 alunos e 10 alunas?
<br><br>

Combina&ccedil;&otilde;es completas. A t&eacute;cnica dos &quot;separadores&quot;.
<br><br>

Problema 13: De quantas maneiras podemos guardar 10 bolas-de-gude id&eacute;nticas se dispomos de 5 latas distintas?
<br>
Problema 14: E se n&atilde;o quisermos deixar latas vazias?


	&nbsp;<br>
	&nbsp;<br>

<h4><font color="blue">26/04</font></h4>
<br>
    Equa&ccedil;&otilde;es diofantinas.
   <br><br> 
Problema 15: Quantas sacolas distintas contendo 4 potes de sorvete de qualquer sabor (repeti&ccedil;&otilde;es permitidas!) 
podemos comprar em uma sorveteria que vende potes de sorvete em 10 sabores diferentes (e estoque ilimitado)?

	&nbsp;<br>
	&nbsp;<br>
	
	
<h4><font color="blue">28/04</font></h4>
<br>
Permuta&ccedil;&otilde;es com elementos repetidos. Anagramas.
<br><br>
Problema 16: Quantos s&atilde;o os anagramas da palavra CADERNO? <br>
Problema 17: E de URUGUAI? <br>
Problema 18: E de URUGUAIANA? <br>
Problema 19: Quantos n&uacute;meros maiores do que 1.000.000 pode ser formados permutando
os algarismos do n&uacute;mero 567788800?<br>
Problema 21: Quantos anagramas da palavra CANETA n&atilde;o possuem a substring &quot;NE&quot;?<br>
Problema 21: Quantos anagramas da palavra CANETA n&atilde;o possuem as letras N e E consecutivas
em qualquer ordem?<br>
Problema 22: Quantos anagramas da palavra CANETA n&atilde;o possuem as letras N e A consecutivas
em qualquer ordem? (<em>Note que muda bastante...</em>)

	&nbsp;<br>
	&nbsp;<br>
	
<h4><font color="blue">03/05</font></h4>
<br>
    O Princípio da Inclusão/Exclusão. Solução do Problema 22.<br><br>
    Problema 23: Quantos inteiros existem entre 1 e 100 que são múltiplos de 2, 3 ou 5?<br>
    Problema 24: Quantas são as permutações caóticas de <em>n</em> elementos?<br><br>
    Programinha em Python para contar (e listar) permutações caóticas. Código no GitHub.
   
	&nbsp;<br>
	&nbsp;<br>	

<h4><font color="blue">05/05</font></h4>
<br>
    Problema 25: Dados um conjunto A e um conjunto B, com |A| = n e |B| = n, 
    quantas funções distintas existem de A em B? <br>
    Problema 26: Dessas funções, quantas são injetoras?
    Problema 27: Quantas são bijetoras?
    Problema 28: Quantas são sobrejetoras? (<em>Este é o mais difícil. Use o Princípio da Inclusão/Exclusão.)</em>
    
	&nbsp;<br>
	&nbsp;<br>	

<h4><font color="blue">10/05</font></h4>
<br>
    O modelo da partícula em movimento sempre para cima ou para a direita.<br>
    O modelo da partícula em movimento sempre para a direita subindo ou descendo (45 graus).<br>
    O Princípio da Reflexão para lidar com situações em que se deseje forçar a passagem da partícula
    por uma certa ordenada (linha horizontal).<br><br>
    
    Problema 29: Quantos caminhos existem do ponto (0,0) ao ponto (100, 16)?
    Problema 30: Desses, quantos possuem algum ponto com ordenada -1 (isto é, quantos passam pela reta y=-1)?
    Problema 31: Em uma eleição com dois candidatos A e B em que A venceu por uma margem de 16 votos,
    de um total de 100 eleitores, em quantas das apurações possíveis de votos 
    (em que os votos vão sendo computados um por um e não houve votos nulos ou em branco) 
    o candidato vencedor jamais se viu em desvantagem?
    Problema 32: A casa de Bob fica no ponto de coordenadas (0,0) de um reticulado, e sua escola fica no ponto
    (8, 10). Caminhando sempre para cima ou para a direita no reticulado, quantos são os caminhos possíveis que levam Bob
    de sua casa à sua escola passando por uma padaria que fica no ponto (4, 4) do mapa?

	&nbsp;<br>
	&nbsp;<br>	

		<p>
        <a href=#><img title="Voltar ao topo" style="height: 35px" src="../seta_voltar.jpeg" alt="Voltar ao topo" ></a>
        </p>

		
  </body>

</html>
